/****************************************************************************

	한글 입력 오토마타

	오후 1:30 01-05-28
	j22000@netian.com

***************************************************************************

-----------------------------------------
상태표
-----------------------------------------
s0 : 처음 상태
s1 : 초성만 입력된상태
s2 : 초성과 중성이 입력된상태
s3 : 초성, 중성, 종성이 입력된상태(글자완성안됨)
-----------------------------------------

------------------------------------------------------------------------------
입력깂의 종류
------------------------------------------------------------------------------
기본 자음	(19)	: ㄱ, ㄴ, ㄷ, ㄹ, ㅁ, ㅂ, ㅅ, ㅇ, ㅈ, ㅊ, ㅋ, ㅌ, ㅍ, ㅎ, ㄲ, ㄸ, ㅃ, ㅆ, ㅉ
기본 모음	(14)	: ㅏ, ㅑ, ㅓ,ㅕ, ㅗ, ㅛ, ㅜ, ㅠ, ㅡ, ㅣ, ㅐ, ㅒ, ㅔ, ㅖ
BackSpace 	: 이전 입력된 1글자를 지움
기타문자		: 입력문자로 사용되는 문자중 위의 문자를 제외한 나머지 문자들
------------------------------------------------------------------------------

-------------------------------------------------------------
기타(내부적으로 새롭게 조합될 문자들)
-------------------------------------------------------------
부자음	(11)	: ㄳ, ㄵ, ㄶ, ㄺ, ㄻ, ㄼ, ㄽ, ㄾ, ㄿ, ㅀ, ㅄ
부모음	(7)	: ㅘ, ㅙ, ㅚ, ㅝ, ㅞ, ㅟ, ㅢ
-------------------------------------------------------------

  조합형 코드표
----------------------------------
초성		중성		종성
----------------------------------
ㄱ=0x8841	ㅏ=0x8461	ㄱ=0x8442
ㄲ=0x8c41	ㅐ=0x8481	ㄲ=0x8443
ㄴ=0x9041	ㅑ=0x84a1	ㄳ=0x8444
ㄷ=0x9441	ㅒ=0x84c1	ㄴ=0x8445
ㄸ=0x9841	ㅓ=0x84e1	ㄵ=0x8446
ㄹ=0x9c41	ㅔ=0x8541	ㄶ=0x8447
ㅁ=0xa041	ㅕ=0x8561	ㄷ=0x8448
ㅂ=0xa441	ㅖ=0x8581	ㄹ=0x8449
ㅃ=0xa841	ㅗ=0x85a1	ㄺ=0x844a
ㅅ=0xac41	ㅘ=0x85c1	ㄻ=0x844b
ㅆ=0xb041	ㅙ=0x85e1	ㄼ=0x844c
ㅇ=0xb441	ㅚ=0x8641	ㄽ=0x844d
ㅈ=0xb841	ㅛ=0x8661	ㄾ=0x844e
ㅉ=0xbc41	ㅜ=0x8681	ㄿ=0x844f
ㅊ=0xc041	ㅝ=0x86a1	ㅀ=0x8450
ㅋ=0xc441	ㅞ=0x86c1	ㅁ=0x8451
ㅌ=0xc841	ㅟ=0x86e1	ㅂ=0x8453
ㅍ=0xcc41	ㅠ=0x8741	ㅄ=0x8454
ㅎ=0xd041	ㅡ=0x8761	ㅅ=0x8455
			ㅢ=0x8781	ㅆ=0x8456
			ㅣ=0x87a1	ㅇ=0x8457
						ㅈ=0x8458
						ㅊ=0x8459
						ㅋ=0x845a
						ㅌ=0x845b
						ㅍ=0x845c
						ㅎ=0x845d
----------------------------------
*****************************************************************************/
/*******************************************************************************/
#define HANINPUT_H


#include <memory.h> 
#include <string.h>
#include <stdlib.h>


/*******************************************************************************/
#ifndef HAN_DEFINE_H
	#include "HAN_Define.h"
#endif

/*
#ifndef KS_COMBI_CODE_CONVERT_C
	#include "KS_COMBI_Code_Convert.c"
#endif
*/
/*******************************************************************************/
//한글 초성,중성,종성
#define HCODE_JAUM	1
#define HCODE_MOUM	2
#define HCODE_BACKSPACE	8
/*******************************************************************************/
typedef struct _HAN_INPUT_KEY_BUFFER
{
	int		status;		//입력 상태
	HCODE	cho;	//초성(ㄱ, ㄴ, ㄷ, ㄹ, ㅁ, ㅂ, ㅅ, ㅇ, ㅈ, ㅊ, ㅋ, ㅌ, ㅍ, ㅎ, ㄲ, ㄸ, ㅃ, ㅆ, ㅉ)
	HCODE	cho2;	//초성(ㄱ(ㄲ,ㄺ), ㄷ(ㄸ), ㅁ(ㄻ), ㅂ(ㄼ,ㅃ), ㅅ(ㄳ,ㄽ, ㅄ, ㅆ), ㅈ(ㄵ,ㅉ), ㅌ(ㄾ), ㅍ(ㄿ), ㅎ(ㄶ, ㅀ))
	HCODE	jung;	//중성(ㅏ, ㅑ, ㅓ,ㅕ, ㅗ, ㅛ, ㅜ, ㅠ, ㅡ, ㅣ, ㅐ, ㅒ, ㅔ, ㅖ, ㅘ, ㅙ, ㅚ, ㅝ, ㅞ, ㅟ, ㅢ)
	HCODE	jong;	//종성(ㄱ, ㄴ, ㄷ, ㄹ, ㅁ, ㅂ, ㅅ, ㅇ, ㅈ, ㅊ, ㅋ, ㅌ, ㅍ, ㅎ)
	HCODE	jong2;	//종성2(ㄱ(ㄲ,ㄺ), ㅁ(ㄻ), ㅂ(ㄼ), ㅅ(ㄳ,ㄽ, ㅄ, ㅆ), ㅈ(ㄵ), ㅌ(ㄾ), ㅍ(ㄿ), ㅎ(ㄶ, ㅀ))
	char	*buf;	//입력된 문자열이 저장될 공간
	//char	buf[1024];	//입력된 문자열이 저장될 공간
	char	*p;
	int		size;	//buf크기
}HAN_INPUT_KEY_BUFFER;

/*******************************************************************************/
#define HCODE_LEFT_CHAR(code)	(char)((code)>>8)
#define HCODE_RIGHT_CHAR(code)	(char)((code)&0x00ff)

